export const categoriesPreviewData = [
    {
        categoryTitle: 'Веганская кухня',
        categoryDescription:
            'Интересны не только убеждённым вегетарианцам, но и тем, кто хочет попробовать вегетарианскую диету и готовить вкусные вегетарианские блюда.',
        detailedRecipe: [
            {
                title: 'Картошка, тушенная с болгарским перцем и фасолью в томатном соусе',
                description:
                    'Картошка, тушенная с болгарским перцем, фасолью, морковью и луком, -  вариант сытного блюда на каждый день. Фасоль в данном случае заменяет мясо, делая рагу сытным и питательным. Чтобы сократить время  приготовления, возьмём консервированную фасоль. Блюдо хоть и простое, но в полной мере наполнено ароматами и имеет выразительный вкус за счёт  добавления томатной пасты.',
                category: 'Вторые блюда',
                likes: 1,
                favorites: 1,
            },
            {
                title: 'Капустные котлеты',
                description:
                    'Капустные котлеты по этому рецепту получаются необычайно пышными и  невероятно вкусными. Мягкий вкус и лёгкая пряная нотка наверняка помогут сделать эти чудесные котлеты из капусты одним из ваших любимых овощных  блюд.',
                category: 'Вторые блюда',
                likes: 1,
                favorites: 2,
            },
        ],
        briefRecipe: [
            {
                title: 'Стейк для вегетарианцев',
                category: 'Вторые блюда',
            },
            {
                title: 'Котлеты из гречки и фасоли',
                category: 'Вторые блюда',
            },
            {
                title: 'Сырный суп с лапшой и брокколи',
                category: 'Первые блюда',
            },
        ],
    },
];
