export const horizontalCards = [
    {
        imgSrc: './recipes-images/horizontal-card-1.png',
        title: 'Кнели со спагетти',
        description:
            'Как раз после праздников, когда мясные продукты еще остались, но никто их уже не хочет, время варить солянку.',
        category: 'Вторые блюда',
        favorites: 85,
        likes: 152,
    },
    {
        imgSrc: './recipes-images/horizontal-card-2.png',
        title: 'Пряная ветчина по итальянски',
        description:
            'Как раз после праздников, когда мясные продукты еще остались, но никто их уже не хочет, время варить солянку.',
        category: 'Вторые блюда',
        favorites: 159,
        likes: 257,
        recommendation: {
            user: 'Елена Высоцкая',
            imgSrc: './avatars/avatar-1.png',
        },
    },
    {
        imgSrc: './recipes-images/horizontal-card-3.png',
        title: 'Лапша с курицей и шафраном',
        description:
            'Как раз после праздников, когда мясные продукты еще остались, но никто их уже не хочет, время варить солянку.',
        category: 'Вторые блюда',
        favorites: 258,
        likes: 342,
        recommendation: {
            user: 'Alex Cook',
            imgSrc: './avatars/avatar-2.png',
        },
    },
    {
        imgSrc: './recipes-images/horizontal-card-4.png',
        title: 'Том-ям с капустой кимчи',
        description:
            'Как раз после праздников, когда мясные продукты еще остались, но никто их уже не хочет, время варить солянку.',
        category: 'Национальные',
        favorites: 124,
        likes: 324,
    },
];

export const horizontalCardsVegan = [
    {
        imgSrc: './recipes-images/horizontal-card-5.png',
        title: 'Картошка, тушенная с болгарским перцем и фасолью в томатном соусе',
        description:
            'Картошка, тушенная с болгарским перцем, фасолью, морковью и луком, -  вариант сытного блюда на каждый день. Фасоль в данном случае заменяет  мясо, делая рагу сытным и питательным. Чтобы сократить время  приготовления, возьмём консервированную фасоль. Блюдо хоть и простое, но в полной мере наполнено ароматами и имеет выразительный вкус за счёт  добавления томатной пасты.',
        category: 'Национальные',
        favorites: 85,
        likes: 152,
    },
    {
        imgSrc: './recipes-images/horizontal-card-6.png',
        title: 'Картофельные рулетики с грибами',
        description:
            'Рекомендую всем приготовить постное блюдо из картофеля и грибов.  Готовится это блюдо без яиц, без мяса и без сыра, из самых простых  ингредиентов, а получается очень вкусно и сытно. Постный рецепт  картофельных рулетиков с грибами, в томатном соусе, - на обед, ужин и  даже на праздничный стол!',
        category: 'Детские блюда',
        favorites: 159,
        likes: 257,
    },
    {
        imgSrc: './recipes-images/horizontal-card-4.png',
        title: 'Том-ям с капустой кимчи',
        description:
            'Как раз после праздников, когда мясные продукты еще остались, но никто их уже не хочет, время варить солянку.',
        category: 'Национальные',
        favorites: 124,
        likes: 324,
    },
    {
        imgSrc: './recipes-images/horizontal-card-7.png',
        title: 'Овощная лазанья из лаваша',
        description:
            'Большое, сытное блюдо для ценителей блюд без мяса! Такая лазанья  готовится с овощным соусом и соусом бешамель, а вместо листов для  лазаньи используется тонкий лаваш.',
        category: 'Блюда на гриле',
        favorites: 85,
        likes: 152,
    },
    {
        imgSrc: './recipes-images/horizontal-card-8.png',
        title: 'Тефтели из булгура и чечевицы, запечённые в томатном соусе',
        description:
            'Тефтели из булгура и чечевицы – яркие и питательные, отлично подходят  для постного и вегетарианского меню. Тефтели получаются нежными, а также сочными и ароматными благодаря использованию томатного соуса и душистых пряностей.',
        category: 'Вторые блюда',
        favorites: 85,
        likes: 152,
    },
    {
        imgSrc: './recipes-images/horizontal-card-8.png',
        title: 'Тефтели из булгура и чечевицы, запечённые в томатном соусе',
        description:
            'Тефтели из булгура и чечевицы – яркие и питательные, отлично подходят  для постного и вегетарианского меню. Тефтели получаются нежными, а также сочными и ароматными благодаря использованию томатного соуса и душистых пряностей.',
        category: 'Вторые блюда',
        favorites: 85,
        likes: 152,
    },
    {
        imgSrc: './recipes-images/horizontal-card-9.png',
        title: 'Чесночная картошка',
        description:
            'Такая картошечка украсит любой семейный обед! Все будут в полном  восторге, очень вкусно! Аромат чеснока, хрустящая корочка на картошечке - просто объедение! Отличная идея для обеда или ужина, готовится просто!',
        category: 'Национальные',
        favorites: 124,
        likes: 324,
    },
    {
        imgSrc: './recipes-images/horizontal-card-10.png',
        title: 'Пури',
        description:
            'Пури - это индийские жареные лепешки, которые готовятся из пресного  теста. Рецепт лепешек пури требует самых доступных ингредиентов, и  времени на приготовление хрустящих лепешек уйдет мало.',
        category: 'Национальные',
        favorites: 124,
        likes: 324,
    },
];

export const horizontalCardsJuicy = [
    {
        imgSrc: './recipes-images/horizontal-card-3.png',
        title: 'Лапша с курицей и шафраном',
        description:
            'Как раз после праздников, когда мясные продукты еще остались, но никто их уже не хочет, время варить солянку.',
        category: 'Вторые блюда',
        favorites: 258,
        likes: 342,
        recommendation: {
            user: 'Alex Cook',
            imgSrc: './avatars/avatar-2.png',
        },
    },
    {
        imgSrc: './recipes-images/horizontal-card-4.png',
        title: 'Том-ям с капустой кимчи',
        description:
            'Как раз после праздников, когда мясные продукты еще остались, но никто их уже не хочет, время варить солянку.',
        category: 'Национальные',
        favorites: 124,
        likes: 324,
    },
    {
        imgSrc: './recipes-images/horizontal-card-2.png',
        title: 'Пряная ветчина по итальянски',
        description:
            'Как раз после праздников, когда мясные продукты еще остались, но никто их уже не хочет, время варить солянку.',
        category: 'Вторые блюда',
        favorites: 159,
        likes: 257,
        recommendation: {
            user: 'Елена Высоцкая',
            imgSrc: './avatars/avatar-1.png',
        },
    },
    {
        imgSrc: './recipes-images/horizontal-card-1.png',
        title: 'Кнели со спагетти',
        description:
            'Как раз после праздников, когда мясные продукты еще остались, но никто их уже не хочет, время варить солянку.',
        category: 'Вторые блюда',
        favorites: 85,
        likes: 152,
    },
    {
        imgSrc: './recipes-images/horizontal-card-5.png',
        title: 'Картошка, тушенная с болгарским перцем и фасолью в томатном соусе',
        description:
            'Картошка, тушенная с болгарским перцем, фасолью, морковью и луком, -  вариант сытного блюда на каждый день. Фасоль в данном случае заменяет  мясо, делая рагу сытным и питательным. Чтобы сократить время  приготовления, возьмём консервированную фасоль. Блюдо хоть и простое, но в полной мере наполнено ароматами и имеет выразительный вкус за счёт  добавления томатной пасты.',
        category: 'Национальные',
        favorites: 85,
        likes: 152,
    },
    {
        imgSrc: './recipes-images/horizontal-card-6.png',
        title: 'Картофельные рулетики с грибами',
        description:
            'Рекомендую всем приготовить постное блюдо из картофеля и грибов.  Готовится это блюдо без яиц, без мяса и без сыра, из самых простых  ингредиентов, а получается очень вкусно и сытно. Постный рецепт  картофельных рулетиков с грибами, в томатном соусе, - на обед, ужин и  даже на праздничный стол!',
        category: 'Детские блюда',
        favorites: 159,
        likes: 257,
    },
    {
        imgSrc: './recipes-images/horizontal-card-7.png',
        title: 'Овощная лазанья из лаваша',
        description:
            'Большое, сытное блюдо для ценителей блюд без мяса! Такая лазанья  готовится с овощным соусом и соусом бешамель, а вместо листов для  лазаньи используется тонкий лаваш.',
        category: 'Блюда на гриле',
        favorites: 85,
        likes: 152,
    },
    {
        imgSrc: './recipes-images/horizontal-card-8.png',
        title: 'Тефтели из булгура и чечевицы, запечённые в томатном соусе',
        description:
            'Тефтели из булгура и чечевицы – яркие и питательные, отлично подходят  для постного и вегетарианского меню. Тефтели получаются нежными, а также сочными и ароматными благодаря использованию томатного соуса и душистых пряностей.',
        category: 'Вторые блюда',
        favorites: 85,
        likes: 152,
    },
];

export const usersPosts = [
    {
        user: 'Елена Высоцкая',
        userHandle: '@elenapovar',
        imgSrc: './avatars/avatar-1.png',
        post: 'Как раз после праздников, когда мясные продукты еще остались, но никто их уже не хочет, время варить солянку.',
    },
    {
        user: 'Alex Cook',
        userHandle: '@funtasticooking',
        imgSrc: './avatars/avatar-2.png',
        post: 'Как раз после праздников, когда мясные продукты еще остались, но никто их уже не хочет, время варить солянку.',
    },
    {
        user: 'Екатерина Константинопольская',
        userHandle: '@bake_and_pie',
        imgSrc: './avatars/avatar-3.png',
        post: 'Как раз после праздников, когда мясные продукты еще остались, но никто их уже не хочет, время варить солянку.',
    },
];
